compressible/resonators/axisymmetric/sonicFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            patch;
        nFaces          50;
        startFace       19750;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       19800;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       19850;
    }
    bottom_axis
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       20050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20000;
        startFace       20250;
    }
)

// ************************************************************************* //
